Revit 2024 API
BuiltInFailures.SketchFailures.NotOneCCWLoop Property
 This sketch defines more than one footprint. Make sure the sketch contains only one outermost loop and that there are no loops inside inner loops.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId NotOneCCWLoop { get; }
Visual Basic
Public Shared ReadOnly Property NotOneCCWLoop As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ NotOneCCWLoop {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace